keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5s_bf.h
/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN24 */
#define IFX_PSI5S_ACCEN0_EN24_OFF (24)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN25 */
#define IFX_PSI5S_ACCEN0_EN25_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN25 */
#define IFX_PSI5S_ACCEN0_EN25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN25 */
#define IFX_PSI5S_ACCEN0_EN25_OFF (25)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN26 */
#define IFX_PSI5S_ACCEN0_EN26_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN26 */
#define IFX_PSI5S_ACCEN0_EN26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN26 */
#define IFX_PSI5S_ACCEN0_EN26_OFF (26)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN27 */
#define IFX_PSI5S_ACCEN0_EN27_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN27 */
#define IFX_PSI5S_ACCEN0_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN27 */
#define IFX_PSI5S_ACCEN0_EN27_OFF (27)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN28 */
#define IFX_PSI5S_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN28 */
#define IFX_PSI5S_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN28 */
#define IFX_PSI5S_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN29 */
#define IFX_PSI5S_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN29 */
#define IFX_PSI5S_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN29 */
#define IFX_PSI5S_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN2 */
#define IFX_PSI5S_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN2 */
#define IFX_PSI5S_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN2 */
#define IFX_PSI5S_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN30 */
#define IFX_PSI5S_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN30 */
#define IFX_PSI5S_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN30 */
#define IFX_PSI5S_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN31 */
#define IFX_PSI5S_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN31 */
#define IFX_PSI5S_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN31 */
#define IFX_PSI5S_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN3 */
#define IFX_PSI5S_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN3 */
#define IFX_PSI5S_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN3 */
#define IFX_PSI5S_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN4 */
#define IFX_PSI5S_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN4 */
#define IFX_PSI5S_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN4 */
#define IFX_PSI5S_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN5 */
#define IFX_PSI5S_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN5 */
#define IFX_PSI5S_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN5 */
#define IFX_PSI5S_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN6 */
#define IFX_PSI5S_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN6 */
#define IFX_PSI5S_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN6 */
#define IFX_PSI5S_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN7 */
#define IFX_PSI5S_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN7 */
#define IFX_PSI5S_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN7 */
#define IFX_PSI5S_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN8 */
#define IFX_PSI5S_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN8 */
#define IFX_PSI5S_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN8 */
#define IFX_PSI5S_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_PSI5S_ACCEN0_Bits.EN9 */
#define IFX_PSI5S_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_ACCEN0_Bits.EN9 */
#define IFX_PSI5S_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_ACCEN0_Bits.EN9 */
#define IFX_PSI5S_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_PSI5S_BAR_Bits.BA */
#define IFX_PSI5S_BAR_BA_LEN (30)

/** \\brief  Mask for Ifx_PSI5S_BAR_Bits.BA */
#define IFX_PSI5S_BAR_BA_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_PSI5S_BAR_Bits.BA */
#define IFX_PSI5S_BAR_BA_OFF (2)

/** \\brief  Length for Ifx_PSI5S_BG_Bits.BR_VALUE */
#define IFX_PSI5S_BG_BR_VALUE_LEN (13)

/** \\brief  Mask for Ifx_PSI5S_BG_Bits.BR_VALUE */
#define IFX_PSI5S_BG_BR_VALUE_MSK (0x1fff)

/** \\brief  Offset for Ifx_PSI5S_BG_Bits.BR_VALUE */
#define IFX_PSI5S_BG_BR_VALUE_OFF (0)

/** \\brief  Length for Ifx_PSI5S_CDW_Bits.SD0 */
#define IFX_PSI5S_CDW_SD0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CDW_Bits.SD0 */
#define IFX_PSI5S_CDW_SD0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CDW_Bits.SD0 */
#define IFX_PSI5S_CDW_SD0_OFF (0)

/** \\brief  Length for Ifx_PSI5S_CDW_Bits.SD1 */
#define IFX_PSI5S_CDW_SD1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CDW_Bits.SD1 */
#define IFX_PSI5S_CDW_SD1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CDW_Bits.SD1 */
#define IFX_PSI5S_CDW_SD1_OFF (1)

/** \\brief  Length for Ifx_PSI5S_CDW_Bits.SD2 */
#define IFX_PSI5S_CDW_SD2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CDW_Bits.SD2 */
#define IFX_PSI5S_CDW_SD2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CDW_Bits.SD2 */
#define IFX_PSI5S_CDW_SD2_OFF (2)

/** \\brief  Length for Ifx_PSI5S_CDW_Bits.SD3 */
#define IFX_PSI5S_CDW_SD3_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CDW_Bits.SD3 */
#define IFX_PSI5S_CDW_SD3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CDW_Bits.SD3 */
#define IFX_PSI5S_CDW_SD3_OFF (3)

/** \\brief  Length for Ifx_PSI5S_CDW_Bits.SD4 */
#define IFX_PSI5S_CDW_SD4_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CDW_Bits.SD4 */
#define IFX_PSI5S_CDW_SD4_MSK (0x1)

