keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5s_bf.h
/** \\brief  Offset for Ifx_PSI5S_CDW_Bits.SD4 */
#define IFX_PSI5S_CDW_SD4_OFF (4)

/** \\brief  Length for Ifx_PSI5S_CDW_Bits.SD5 */
#define IFX_PSI5S_CDW_SD5_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CDW_Bits.SD5 */
#define IFX_PSI5S_CDW_SD5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CDW_Bits.SD5 */
#define IFX_PSI5S_CDW_SD5_OFF (5)

/** \\brief  Length for Ifx_PSI5S_CDW_Bits.SD6 */
#define IFX_PSI5S_CDW_SD6_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CDW_Bits.SD6 */
#define IFX_PSI5S_CDW_SD6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CDW_Bits.SD6 */
#define IFX_PSI5S_CDW_SD6_OFF (6)

/** \\brief  Length for Ifx_PSI5S_CDW_Bits.SD7 */
#define IFX_PSI5S_CDW_SD7_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CDW_Bits.SD7 */
#define IFX_PSI5S_CDW_SD7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CDW_Bits.SD7 */
#define IFX_PSI5S_CDW_SD7_OFF (7)

/** \\brief  Length for Ifx_PSI5S_CDW_Bits.TSI */
#define IFX_PSI5S_CDW_TSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CDW_Bits.TSI */
#define IFX_PSI5S_CDW_TSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CDW_Bits.TSI */
#define IFX_PSI5S_CDW_TSI_OFF (8)

/** \\brief  Length for Ifx_PSI5S_CLC_Bits.DISR */
#define IFX_PSI5S_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CLC_Bits.DISR */
#define IFX_PSI5S_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CLC_Bits.DISR */
#define IFX_PSI5S_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_PSI5S_CLC_Bits.DISS */
#define IFX_PSI5S_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CLC_Bits.DISS */
#define IFX_PSI5S_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CLC_Bits.DISS */
#define IFX_PSI5S_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_PSI5S_CLC_Bits.EDIS */
#define IFX_PSI5S_CLC_EDIS_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CLC_Bits.EDIS */
#define IFX_PSI5S_CLC_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CLC_Bits.EDIS */
#define IFX_PSI5S_CLC_EDIS_OFF (3)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.BRS */
#define IFX_PSI5S_CON_BRS_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.BRS */
#define IFX_PSI5S_CON_BRS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.BRS */
#define IFX_PSI5S_CON_BRS_OFF (13)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.FDE */
#define IFX_PSI5S_CON_FDE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.FDE */
#define IFX_PSI5S_CON_FDE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.FDE */
#define IFX_PSI5S_CON_FDE_OFF (11)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.FE */
#define IFX_PSI5S_CON_FE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.FE */
#define IFX_PSI5S_CON_FE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.FE */
#define IFX_PSI5S_CON_FE_OFF (9)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.FEN */
#define IFX_PSI5S_CON_FEN_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.FEN */
#define IFX_PSI5S_CON_FEN_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.FEN */
#define IFX_PSI5S_CON_FEN_OFF (6)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.LB */
#define IFX_PSI5S_CON_LB_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.LB */
#define IFX_PSI5S_CON_LB_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.LB */
#define IFX_PSI5S_CON_LB_OFF (14)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.M */
#define IFX_PSI5S_CON_M_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.M */
#define IFX_PSI5S_CON_M_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.M */
#define IFX_PSI5S_CON_M_OFF (0)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.MTX */
#define IFX_PSI5S_CON_MTX_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.MTX */
#define IFX_PSI5S_CON_MTX_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.MTX */
#define IFX_PSI5S_CON_MTX_OFF (16)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.ODD */
#define IFX_PSI5S_CON_ODD_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.ODD */
#define IFX_PSI5S_CON_ODD_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.ODD */
#define IFX_PSI5S_CON_ODD_OFF (12)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.ODDTX */
#define IFX_PSI5S_CON_ODDTX_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.ODDTX */
#define IFX_PSI5S_CON_ODDTX_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.ODDTX */
#define IFX_PSI5S_CON_ODDTX_OFF (28)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.OE */
#define IFX_PSI5S_CON_OE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.OE */
#define IFX_PSI5S_CON_OE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.OE */
#define IFX_PSI5S_CON_OE_OFF (10)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.OEN */
#define IFX_PSI5S_CON_OEN_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.OEN */
#define IFX_PSI5S_CON_OEN_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.OEN */
#define IFX_PSI5S_CON_OEN_OFF (7)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.PE */
#define IFX_PSI5S_CON_PE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.PE */
#define IFX_PSI5S_CON_PE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.PE */
#define IFX_PSI5S_CON_PE_OFF (8)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.PEN */
#define IFX_PSI5S_CON_PEN_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.PEN */
#define IFX_PSI5S_CON_PEN_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.PEN */
#define IFX_PSI5S_CON_PEN_OFF (5)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.R */
#define IFX_PSI5S_CON_R_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.R */
#define IFX_PSI5S_CON_R_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.R */
#define IFX_PSI5S_CON_R_OFF (15)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.REN */
#define IFX_PSI5S_CON_REN_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.REN */
#define IFX_PSI5S_CON_REN_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.REN */
#define IFX_PSI5S_CON_REN_OFF (4)

/** \\brief  Length for Ifx_PSI5S_CON_Bits.STP */
#define IFX_PSI5S_CON_STP_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_CON_Bits.STP */
#define IFX_PSI5S_CON_STP_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_CON_Bits.STP */
#define IFX_PSI5S_CON_STP_OFF (3)

/** \\brief  Length for Ifx_PSI5S_CTV_Bits.CTC */
#define IFX_PSI5S_CTV_CTC_LEN (16)

