keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5s_bf.h
/** \\brief  Mask for Ifx_PSI5S_CTV_Bits.CTC */
#define IFX_PSI5S_CTV_CTC_MSK (0xffff)

/** \\brief  Offset for Ifx_PSI5S_CTV_Bits.CTC */
#define IFX_PSI5S_CTV_CTC_OFF (16)

/** \\brief  Length for Ifx_PSI5S_CTV_Bits.CTV */
#define IFX_PSI5S_CTV_CTV_LEN (16)

/** \\brief  Mask for Ifx_PSI5S_CTV_Bits.CTV */
#define IFX_PSI5S_CTV_CTV_MSK (0xffff)

/** \\brief  Offset for Ifx_PSI5S_CTV_Bits.CTV */
#define IFX_PSI5S_CTV_CTV_OFF (0)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.FC0 */
#define IFX_PSI5S_FCNT_FC0_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.FC0 */
#define IFX_PSI5S_FCNT_FC0_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.FC0 */
#define IFX_PSI5S_FCNT_FC0_OFF (0)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.FC1 */
#define IFX_PSI5S_FCNT_FC1_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.FC1 */
#define IFX_PSI5S_FCNT_FC1_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.FC1 */
#define IFX_PSI5S_FCNT_FC1_OFF (3)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.FC2 */
#define IFX_PSI5S_FCNT_FC2_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.FC2 */
#define IFX_PSI5S_FCNT_FC2_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.FC2 */
#define IFX_PSI5S_FCNT_FC2_OFF (6)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.FC3 */
#define IFX_PSI5S_FCNT_FC3_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.FC3 */
#define IFX_PSI5S_FCNT_FC3_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.FC3 */
#define IFX_PSI5S_FCNT_FC3_OFF (9)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.FC4 */
#define IFX_PSI5S_FCNT_FC4_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.FC4 */
#define IFX_PSI5S_FCNT_FC4_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.FC4 */
#define IFX_PSI5S_FCNT_FC4_OFF (12)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.FC5 */
#define IFX_PSI5S_FCNT_FC5_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.FC5 */
#define IFX_PSI5S_FCNT_FC5_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.FC5 */
#define IFX_PSI5S_FCNT_FC5_OFF (15)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.FC6 */
#define IFX_PSI5S_FCNT_FC6_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.FC6 */
#define IFX_PSI5S_FCNT_FC6_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.FC6 */
#define IFX_PSI5S_FCNT_FC6_OFF (18)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.FC7 */
#define IFX_PSI5S_FCNT_FC7_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.FC7 */
#define IFX_PSI5S_FCNT_FC7_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.FC7 */
#define IFX_PSI5S_FCNT_FC7_OFF (21)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.NFCLR0 */
#define IFX_PSI5S_FCNT_NFCLR0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.NFCLR0 */
#define IFX_PSI5S_FCNT_NFCLR0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.NFCLR0 */
#define IFX_PSI5S_FCNT_NFCLR0_OFF (24)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.NFCLR1 */
#define IFX_PSI5S_FCNT_NFCLR1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.NFCLR1 */
#define IFX_PSI5S_FCNT_NFCLR1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.NFCLR1 */
#define IFX_PSI5S_FCNT_NFCLR1_OFF (25)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.NFCLR2 */
#define IFX_PSI5S_FCNT_NFCLR2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.NFCLR2 */
#define IFX_PSI5S_FCNT_NFCLR2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.NFCLR2 */
#define IFX_PSI5S_FCNT_NFCLR2_OFF (26)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.NFCLR3 */
#define IFX_PSI5S_FCNT_NFCLR3_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.NFCLR3 */
#define IFX_PSI5S_FCNT_NFCLR3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.NFCLR3 */
#define IFX_PSI5S_FCNT_NFCLR3_OFF (27)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.NFCLR4 */
#define IFX_PSI5S_FCNT_NFCLR4_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.NFCLR4 */
#define IFX_PSI5S_FCNT_NFCLR4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.NFCLR4 */
#define IFX_PSI5S_FCNT_NFCLR4_OFF (28)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.NFCLR5 */
#define IFX_PSI5S_FCNT_NFCLR5_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.NFCLR5 */
#define IFX_PSI5S_FCNT_NFCLR5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.NFCLR5 */
#define IFX_PSI5S_FCNT_NFCLR5_OFF (29)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.NFCLR6 */
#define IFX_PSI5S_FCNT_NFCLR6_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.NFCLR6 */
#define IFX_PSI5S_FCNT_NFCLR6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.NFCLR6 */
#define IFX_PSI5S_FCNT_NFCLR6_OFF (30)

/** \\brief  Length for Ifx_PSI5S_FCNT_Bits.NFCLR7 */
#define IFX_PSI5S_FCNT_NFCLR7_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_FCNT_Bits.NFCLR7 */
#define IFX_PSI5S_FCNT_NFCLR7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_FCNT_Bits.NFCLR7 */
#define IFX_PSI5S_FCNT_NFCLR7_OFF (31)

/** \\brief  Length for Ifx_PSI5S_FDO_Bits.DM */
#define IFX_PSI5S_FDO_DM_LEN (2)

/** \\brief  Mask for Ifx_PSI5S_FDO_Bits.DM */
#define IFX_PSI5S_FDO_DM_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5S_FDO_Bits.DM */
#define IFX_PSI5S_FDO_DM_OFF (14)

/** \\brief  Length for Ifx_PSI5S_FDO_Bits.STEP */
#define IFX_PSI5S_FDO_STEP_LEN (11)

/** \\brief  Mask for Ifx_PSI5S_FDO_Bits.STEP */
#define IFX_PSI5S_FDO_STEP_MSK (0x7ff)

/** \\brief  Offset for Ifx_PSI5S_FDO_Bits.STEP */
#define IFX_PSI5S_FDO_STEP_OFF (0)

/** \\brief  Length for Ifx_PSI5S_FDR_Bits.DM */
#define IFX_PSI5S_FDR_DM_LEN (2)

/** \\brief  Mask for Ifx_PSI5S_FDR_Bits.DM */
#define IFX_PSI5S_FDR_DM_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5S_FDR_Bits.DM */
#define IFX_PSI5S_FDR_DM_OFF (14)

/** \\brief  Length for Ifx_PSI5S_FDR_Bits.RESULT */
#define IFX_PSI5S_FDR_RESULT_LEN (10)

/** \\brief  Mask for Ifx_PSI5S_FDR_Bits.RESULT */
#define IFX_PSI5S_FDR_RESULT_MSK (0x3ff)

/** \\brief  Offset for Ifx_PSI5S_FDR_Bits.RESULT */
#define IFX_PSI5S_FDR_RESULT_OFF (16)

/** \\brief  Length for Ifx_PSI5S_FDR_Bits.STEP */
#define IFX_PSI5S_FDR_STEP_LEN (10)

/** \\brief  Mask for Ifx_PSI5S_FDR_Bits.STEP */
#define IFX_PSI5S_FDR_STEP_MSK (0x3ff)

