keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5s_bf.h
/** \\brief  Offset for Ifx_PSI5S_FDR_Bits.STEP */
#define IFX_PSI5S_FDR_STEP_OFF (0)

/** \\brief  Length for Ifx_PSI5S_FDRT_Bits.DM */
#define IFX_PSI5S_FDRT_DM_LEN (2)

/** \\brief  Mask for Ifx_PSI5S_FDRT_Bits.DM */
#define IFX_PSI5S_FDRT_DM_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5S_FDRT_Bits.DM */
#define IFX_PSI5S_FDRT_DM_OFF (14)

/** \\brief  Length for Ifx_PSI5S_FDRT_Bits.ECEA */
#define IFX_PSI5S_FDRT_ECEA_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_FDRT_Bits.ECEA */
#define IFX_PSI5S_FDRT_ECEA_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_FDRT_Bits.ECEA */
#define IFX_PSI5S_FDRT_ECEA_OFF (29)

/** \\brief  Length for Ifx_PSI5S_FDRT_Bits.ECEB */
#define IFX_PSI5S_FDRT_ECEB_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_FDRT_Bits.ECEB */
#define IFX_PSI5S_FDRT_ECEB_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_FDRT_Bits.ECEB */
#define IFX_PSI5S_FDRT_ECEB_OFF (30)

/** \\brief  Length for Ifx_PSI5S_FDRT_Bits.ECS */
#define IFX_PSI5S_FDRT_ECS_LEN (3)

/** \\brief  Mask for Ifx_PSI5S_FDRT_Bits.ECS */
#define IFX_PSI5S_FDRT_ECS_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5S_FDRT_Bits.ECS */
#define IFX_PSI5S_FDRT_ECS_OFF (26)

/** \\brief  Length for Ifx_PSI5S_FDRT_Bits.RESULT */
#define IFX_PSI5S_FDRT_RESULT_LEN (10)

/** \\brief  Mask for Ifx_PSI5S_FDRT_Bits.RESULT */
#define IFX_PSI5S_FDRT_RESULT_MSK (0x3ff)

/** \\brief  Offset for Ifx_PSI5S_FDRT_Bits.RESULT */
#define IFX_PSI5S_FDRT_RESULT_OFF (16)

/** \\brief  Length for Ifx_PSI5S_FDRT_Bits.STEP */
#define IFX_PSI5S_FDRT_STEP_LEN (10)

/** \\brief  Mask for Ifx_PSI5S_FDRT_Bits.STEP */
#define IFX_PSI5S_FDRT_STEP_MSK (0x3ff)

/** \\brief  Offset for Ifx_PSI5S_FDRT_Bits.STEP */
#define IFX_PSI5S_FDRT_STEP_OFF (0)

/** \\brief  Length for Ifx_PSI5S_FDV_Bits.FD_VALUE */
#define IFX_PSI5S_FDV_FD_VALUE_LEN (11)

/** \\brief  Mask for Ifx_PSI5S_FDV_Bits.FD_VALUE */
#define IFX_PSI5S_FDV_FD_VALUE_MSK (0x7ff)

/** \\brief  Offset for Ifx_PSI5S_FDV_Bits.FD_VALUE */
#define IFX_PSI5S_FDV_FD_VALUE_OFF (0)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ASC */
#define IFX_PSI5S_GCR_ASC_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ASC */
#define IFX_PSI5S_GCR_ASC_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ASC */
#define IFX_PSI5S_GCR_ASC_OFF (31)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN0 */
#define IFX_PSI5S_GCR_CEN0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN0 */
#define IFX_PSI5S_GCR_CEN0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN0 */
#define IFX_PSI5S_GCR_CEN0_OFF (16)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN1 */
#define IFX_PSI5S_GCR_CEN1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN1 */
#define IFX_PSI5S_GCR_CEN1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN1 */
#define IFX_PSI5S_GCR_CEN1_OFF (17)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN2 */
#define IFX_PSI5S_GCR_CEN2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN2 */
#define IFX_PSI5S_GCR_CEN2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN2 */
#define IFX_PSI5S_GCR_CEN2_OFF (18)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN3 */
#define IFX_PSI5S_GCR_CEN3_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN3 */
#define IFX_PSI5S_GCR_CEN3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN3 */
#define IFX_PSI5S_GCR_CEN3_OFF (19)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN4 */
#define IFX_PSI5S_GCR_CEN4_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN4 */
#define IFX_PSI5S_GCR_CEN4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN4 */
#define IFX_PSI5S_GCR_CEN4_OFF (20)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CRCI */
#define IFX_PSI5S_GCR_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CRCI */
#define IFX_PSI5S_GCR_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CRCI */
#define IFX_PSI5S_GCR_CRCI_OFF (0)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC0 */
#define IFX_PSI5S_GCR_ETC0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC0 */
#define IFX_PSI5S_GCR_ETC0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC0 */
#define IFX_PSI5S_GCR_ETC0_OFF (8)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC1 */
#define IFX_PSI5S_GCR_ETC1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC1 */
#define IFX_PSI5S_GCR_ETC1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC1 */
#define IFX_PSI5S_GCR_ETC1_OFF (9)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC2 */
#define IFX_PSI5S_GCR_ETC2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC2 */
#define IFX_PSI5S_GCR_ETC2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC2 */
#define IFX_PSI5S_GCR_ETC2_OFF (10)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC3 */
#define IFX_PSI5S_GCR_ETC3_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC3 */
#define IFX_PSI5S_GCR_ETC3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC3 */
#define IFX_PSI5S_GCR_ETC3_OFF (11)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC4 */
#define IFX_PSI5S_GCR_ETC4_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC4 */
#define IFX_PSI5S_GCR_ETC4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC4 */
#define IFX_PSI5S_GCR_ETC4_OFF (12)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.FE */
#define IFX_PSI5S_GCR_FE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.FE */
#define IFX_PSI5S_GCR_FE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.FE */
#define IFX_PSI5S_GCR_FE_OFF (4)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.HDI */
#define IFX_PSI5S_GCR_HDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.HDI */
#define IFX_PSI5S_GCR_HDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.HDI */
#define IFX_PSI5S_GCR_HDI_OFF (7)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.IDT */
#define IFX_PSI5S_GCR_IDT_LEN (4)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.IDT */
#define IFX_PSI5S_GCR_IDT_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.IDT */
#define IFX_PSI5S_GCR_IDT_OFF (24)

