keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5s_bf.h
/** \\brief  Offset for Ifx_PSI5S_PGC_Bits.PTE */
#define IFX_PSI5S_PGC_PTE_OFF (19)

/** \\brief  Length for Ifx_PSI5S_PGC_Bits.TBS */
#define IFX_PSI5S_PGC_TBS_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_PGC_Bits.TBS */
#define IFX_PSI5S_PGC_TBS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_PGC_Bits.TBS */
#define IFX_PSI5S_PGC_TBS_OFF (15)

/** \\brief  Length for Ifx_PSI5S_PGC_Bits.TXCMD */
#define IFX_PSI5S_PGC_TXCMD_LEN (5)

/** \\brief  Mask for Ifx_PSI5S_PGC_Bits.TXCMD */
#define IFX_PSI5S_PGC_TXCMD_MSK (0x1f)

/** \\brief  Offset for Ifx_PSI5S_PGC_Bits.TXCMD */
#define IFX_PSI5S_PGC_TXCMD_OFF (0)

/** \\brief  Length for Ifx_PSI5S_RBUF_Bits.RD_VALUE */
#define IFX_PSI5S_RBUF_RD_VALUE_LEN (9)

/** \\brief  Mask for Ifx_PSI5S_RBUF_Bits.RD_VALUE */
#define IFX_PSI5S_RBUF_RD_VALUE_MSK (0x1ff)

/** \\brief  Offset for Ifx_PSI5S_RBUF_Bits.RD_VALUE */
#define IFX_PSI5S_RBUF_RD_VALUE_OFF (0)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.CRC0 */
#define IFX_PSI5S_RCRA_CRC0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.CRC0 */
#define IFX_PSI5S_RCRA_CRC0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.CRC0 */
#define IFX_PSI5S_RCRA_CRC0_OFF (0)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.CRC1 */
#define IFX_PSI5S_RCRA_CRC1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.CRC1 */
#define IFX_PSI5S_RCRA_CRC1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.CRC1 */
#define IFX_PSI5S_RCRA_CRC1_OFF (1)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.CRC2 */
#define IFX_PSI5S_RCRA_CRC2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.CRC2 */
#define IFX_PSI5S_RCRA_CRC2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.CRC2 */
#define IFX_PSI5S_RCRA_CRC2_OFF (2)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.CRC3 */
#define IFX_PSI5S_RCRA_CRC3_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.CRC3 */
#define IFX_PSI5S_RCRA_CRC3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.CRC3 */
#define IFX_PSI5S_RCRA_CRC3_OFF (3)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.CRC4 */
#define IFX_PSI5S_RCRA_CRC4_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.CRC4 */
#define IFX_PSI5S_RCRA_CRC4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.CRC4 */
#define IFX_PSI5S_RCRA_CRC4_OFF (4)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.CRC5 */
#define IFX_PSI5S_RCRA_CRC5_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.CRC5 */
#define IFX_PSI5S_RCRA_CRC5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.CRC5 */
#define IFX_PSI5S_RCRA_CRC5_OFF (5)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.FIDS */
#define IFX_PSI5S_RCRA_FIDS_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.FIDS */
#define IFX_PSI5S_RCRA_FIDS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.FIDS */
#define IFX_PSI5S_RCRA_FIDS_OFF (9)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.TSEN */
#define IFX_PSI5S_RCRA_TSEN_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.TSEN */
#define IFX_PSI5S_RCRA_TSEN_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.TSEN */
#define IFX_PSI5S_RCRA_TSEN_OFF (6)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.TSP */
#define IFX_PSI5S_RCRA_TSP_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.TSP */
#define IFX_PSI5S_RCRA_TSP_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.TSP */
#define IFX_PSI5S_RCRA_TSP_OFF (7)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.TSTS */
#define IFX_PSI5S_RCRA_TSTS_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.TSTS */
#define IFX_PSI5S_RCRA_TSTS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.TSTS */
#define IFX_PSI5S_RCRA_TSTS_OFF (8)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.UFC0 */
#define IFX_PSI5S_RCRA_UFC0_LEN (2)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.UFC0 */
#define IFX_PSI5S_RCRA_UFC0_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.UFC0 */
#define IFX_PSI5S_RCRA_UFC0_OFF (16)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.UFC1 */
#define IFX_PSI5S_RCRA_UFC1_LEN (2)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.UFC1 */
#define IFX_PSI5S_RCRA_UFC1_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.UFC1 */
#define IFX_PSI5S_RCRA_UFC1_OFF (18)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.UFC2 */
#define IFX_PSI5S_RCRA_UFC2_LEN (2)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.UFC2 */
#define IFX_PSI5S_RCRA_UFC2_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.UFC2 */
#define IFX_PSI5S_RCRA_UFC2_OFF (20)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.UFC3 */
#define IFX_PSI5S_RCRA_UFC3_LEN (2)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.UFC3 */
#define IFX_PSI5S_RCRA_UFC3_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.UFC3 */
#define IFX_PSI5S_RCRA_UFC3_OFF (22)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.UFC4 */
#define IFX_PSI5S_RCRA_UFC4_LEN (2)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.UFC4 */
#define IFX_PSI5S_RCRA_UFC4_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.UFC4 */
#define IFX_PSI5S_RCRA_UFC4_OFF (24)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.UFC5 */
#define IFX_PSI5S_RCRA_UFC5_LEN (2)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.UFC5 */
#define IFX_PSI5S_RCRA_UFC5_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.UFC5 */
#define IFX_PSI5S_RCRA_UFC5_OFF (26)

/** \\brief  Length for Ifx_PSI5S_RCRA_Bits.WDMS */
#define IFX_PSI5S_RCRA_WDMS_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RCRA_Bits.WDMS */
#define IFX_PSI5S_RCRA_WDMS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RCRA_Bits.WDMS */
#define IFX_PSI5S_RCRA_WDMS_OFF (10)

/** \\brief  Length for Ifx_PSI5S_RCRB_Bits.PDL0 */
#define IFX_PSI5S_RCRB_PDL0_LEN (5)

/** \\brief  Mask for Ifx_PSI5S_RCRB_Bits.PDL0 */
#define IFX_PSI5S_RCRB_PDL0_MSK (0x1f)

/** \\brief  Offset for Ifx_PSI5S_RCRB_Bits.PDL0 */
#define IFX_PSI5S_RCRB_PDL0_OFF (0)

/** \\brief  Length for Ifx_PSI5S_RCRB_Bits.PDL1 */
#define IFX_PSI5S_RCRB_PDL1_LEN (5)

/** \\brief  Mask for Ifx_PSI5S_RCRB_Bits.PDL1 */
#define IFX_PSI5S_RCRB_PDL1_MSK (0x1f)

/** \\brief  Offset for Ifx_PSI5S_RCRB_Bits.PDL1 */
#define IFX_PSI5S_RCRB_PDL1_OFF (5)

/** \\brief  Length for Ifx_PSI5S_RCRB_Bits.PDL2 */
#define IFX_PSI5S_RCRB_PDL2_LEN (5)

