keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5s_bf.h
/** \\brief  Mask for Ifx_PSI5S_RCRB_Bits.PDL2 */
#define IFX_PSI5S_RCRB_PDL2_MSK (0x1f)

/** \\brief  Offset for Ifx_PSI5S_RCRB_Bits.PDL2 */
#define IFX_PSI5S_RCRB_PDL2_OFF (10)

/** \\brief  Length for Ifx_PSI5S_RCRB_Bits.PDL3 */
#define IFX_PSI5S_RCRB_PDL3_LEN (5)

/** \\brief  Mask for Ifx_PSI5S_RCRB_Bits.PDL3 */
#define IFX_PSI5S_RCRB_PDL3_MSK (0x1f)

/** \\brief  Offset for Ifx_PSI5S_RCRB_Bits.PDL3 */
#define IFX_PSI5S_RCRB_PDL3_OFF (15)

/** \\brief  Length for Ifx_PSI5S_RCRB_Bits.PDL4 */
#define IFX_PSI5S_RCRB_PDL4_LEN (5)

/** \\brief  Mask for Ifx_PSI5S_RCRB_Bits.PDL4 */
#define IFX_PSI5S_RCRB_PDL4_MSK (0x1f)

/** \\brief  Offset for Ifx_PSI5S_RCRB_Bits.PDL4 */
#define IFX_PSI5S_RCRB_PDL4_OFF (20)

/** \\brief  Length for Ifx_PSI5S_RCRB_Bits.PDL5 */
#define IFX_PSI5S_RCRB_PDL5_LEN (5)

/** \\brief  Mask for Ifx_PSI5S_RCRB_Bits.PDL5 */
#define IFX_PSI5S_RCRB_PDL5_MSK (0x1f)

/** \\brief  Offset for Ifx_PSI5S_RCRB_Bits.PDL5 */
#define IFX_PSI5S_RCRB_PDL5_OFF (25)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.PFC */
#define IFX_PSI5S_RDR_PFC_LEN (4)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.PFC */
#define IFX_PSI5S_RDR_PFC_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.PFC */
#define IFX_PSI5S_RDR_PFC_OFF (28)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD0 */
#define IFX_PSI5S_RDR_RD0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD0 */
#define IFX_PSI5S_RDR_RD0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD0 */
#define IFX_PSI5S_RDR_RD0_OFF (0)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD10 */
#define IFX_PSI5S_RDR_RD10_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD10 */
#define IFX_PSI5S_RDR_RD10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD10 */
#define IFX_PSI5S_RDR_RD10_OFF (10)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD11 */
#define IFX_PSI5S_RDR_RD11_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD11 */
#define IFX_PSI5S_RDR_RD11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD11 */
#define IFX_PSI5S_RDR_RD11_OFF (11)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD12 */
#define IFX_PSI5S_RDR_RD12_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD12 */
#define IFX_PSI5S_RDR_RD12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD12 */
#define IFX_PSI5S_RDR_RD12_OFF (12)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD13 */
#define IFX_PSI5S_RDR_RD13_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD13 */
#define IFX_PSI5S_RDR_RD13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD13 */
#define IFX_PSI5S_RDR_RD13_OFF (13)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD14 */
#define IFX_PSI5S_RDR_RD14_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD14 */
#define IFX_PSI5S_RDR_RD14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD14 */
#define IFX_PSI5S_RDR_RD14_OFF (14)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD15 */
#define IFX_PSI5S_RDR_RD15_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD15 */
#define IFX_PSI5S_RDR_RD15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD15 */
#define IFX_PSI5S_RDR_RD15_OFF (15)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD16 */
#define IFX_PSI5S_RDR_RD16_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD16 */
#define IFX_PSI5S_RDR_RD16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD16 */
#define IFX_PSI5S_RDR_RD16_OFF (16)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD17 */
#define IFX_PSI5S_RDR_RD17_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD17 */
#define IFX_PSI5S_RDR_RD17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD17 */
#define IFX_PSI5S_RDR_RD17_OFF (17)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD18 */
#define IFX_PSI5S_RDR_RD18_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD18 */
#define IFX_PSI5S_RDR_RD18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD18 */
#define IFX_PSI5S_RDR_RD18_OFF (18)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD19 */
#define IFX_PSI5S_RDR_RD19_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD19 */
#define IFX_PSI5S_RDR_RD19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD19 */
#define IFX_PSI5S_RDR_RD19_OFF (19)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD1 */
#define IFX_PSI5S_RDR_RD1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD1 */
#define IFX_PSI5S_RDR_RD1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD1 */
#define IFX_PSI5S_RDR_RD1_OFF (1)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD20 */
#define IFX_PSI5S_RDR_RD20_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD20 */
#define IFX_PSI5S_RDR_RD20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD20 */
#define IFX_PSI5S_RDR_RD20_OFF (20)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD21 */
#define IFX_PSI5S_RDR_RD21_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD21 */
#define IFX_PSI5S_RDR_RD21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD21 */
#define IFX_PSI5S_RDR_RD21_OFF (21)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD22 */
#define IFX_PSI5S_RDR_RD22_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD22 */
#define IFX_PSI5S_RDR_RD22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD22 */
#define IFX_PSI5S_RDR_RD22_OFF (22)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD23 */
#define IFX_PSI5S_RDR_RD23_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD23 */
#define IFX_PSI5S_RDR_RD23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD23 */
#define IFX_PSI5S_RDR_RD23_OFF (23)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD24 */
#define IFX_PSI5S_RDR_RD24_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD24 */
#define IFX_PSI5S_RDR_RD24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_RDR_Bits.RD24 */
#define IFX_PSI5S_RDR_RD24_OFF (24)

/** \\brief  Length for Ifx_PSI5S_RDR_Bits.RD25 */
#define IFX_PSI5S_RDR_RD25_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_RDR_Bits.RD25 */
#define IFX_PSI5S_RDR_RD25_MSK (0x1)

